{
  "user_id": "GME7nGpJQRc2v9T057vJ4oyqAJN2",
  "plan_id": "cooking_technique_focus_001",
  "version": 1,
  "name": "Cooking Technique Focus",
  "title": "Cooking Technique Focus",
  "description": "Tailored to your health goals and preferences",
  "days": [
    {
      "day": 1,
      "date": "2024-01-15",
      "theme": "Asian Cooking Mastery Monday",
      "meals": [
        {
          "meal_type": "breakfast",
          "food_name": "Steamed Chinese Savory Egg Custard with Tofu",
          "description": "Silky steamed egg custard with protein-rich tofu and vegetables",
          "ingredients": [
            {
              "name": "eggs",
              "amount": 3,
              "unit": "large"
            },
            {
              "name": "silken tofu",
              "amount": 150,
              "unit": "g"
            },
            {
              "name": "vegetable broth",
              "amount": 200,
              "unit": "ml"
            },
            {
              "name": "soy sauce",
              "amount": 15,
              "unit": "ml"
            },
            {
              "name": "sesame oil",
              "amount": 5,
              "unit": "ml"
            },
            {
              "name": "scallions",
              "amount": 2,
              "unit": "stalks"
            },
            {
              "name": "carrot",
              "amount": 30,
              "unit": "g"
            },
            {
              "name": "frozen corn",
              "amount": 40,
              "unit": "g"
            },
            {
              "name": "white pepper",
              "amount": 1,
              "unit": "pinch"
            },
            {
              "name": "whole grain toast",
              "amount": 60,
              "unit": "g"
            }
          ],
          "instructions": [
            "STEAMING TECHNIQUE: Set up a steamer by placing a steaming rack in a large pot with 2 inches of water. Bring to a rolling boil.",
            "Dice tofu into small cubes and finely chop scallions and carrot.",
            "Beat eggs thoroughly in a bowl, then slowly whisk in room temperature vegetable broth to prevent curdling.",
            "Add soy sauce, sesame oil, and white pepper. Strain mixture through fine mesh to remove any lumps.",
            "Distribute tofu cubes, carrots, and corn in a heatproof bowl or dish that fits in your steamer.",
            "Pour egg mixture over ingredients. Cover tightly with foil to prevent water droplets from falling on surface.",
            "Steam on medium-high heat for 12-15 minutes until custard is just set but still jiggles slightly in center.",
            "Remove carefully and garnish with chopped scallions.",
            "Toast bread and serve alongside the custard."
          ],
          "prep_time": 25,
          "cooking_method": "steaming",
          "portion_size": "1 serving",
          "calories": 485,
          "protein": 28,
          "carbs": 35,
          "fat": 22,
          "fiber": 6,
          "goal_alignment": "High protein content promotes satiety while steaming preserves nutrients without added fats, supporting weight loss goals."
        },
        {
          "meal_type": "lunch",
          "food_name": "Korean-Style Stir-Fried Glass Noodles with Kimchi and Vegetables",
          "description": "Spicy and tangy stir-fried sweet potato noodles with fermented kimchi",
          "ingredients": [
            {
              "name": "sweet potato glass noodles",
              "amount": 120,
              "unit": "g"
            },
            {
              "name": "kimchi",
              "amount": 150,
              "unit": "g"
            },
            {
              "name": "firm tofu",
              "amount": 120,
              "unit": "g"
            },
            {
              "name": "shiitake mushrooms",
              "amount": 0,
              "unit": "g"
            },
            {
              "name": "bell pepper",
              "amount": 100,
              "unit": "g"
            },
            {
              "name": "carrot",
              "amount": 80,
              "unit": "g"
            },
            {
              "name": "spinach",
              "amount": 100,
              "unit": "g"
            },
            {
              "name": "garlic",
              "amount": 15,
              "unit": "g"
            },
            {
              "name": "ginger",
              "amount": 10,
              "unit": "g"
            },
            {
              "name": "sesame oil",
              "amount": 15,
              "unit": "ml"
            },
            {
              "name": "soy sauce",
              "amount": 20,
              "unit": "ml"
            },
            {
              "name": "rice vinegar",
              "amount": 10,
              "unit": "ml"
            },
            {
              "name": "brown sugar",
              "amount": 8,
              "unit": "g"
            },
            {
              "name": "sesame seeds",
              "amount": 10,
              "unit": "g"
            }
          ],
          "instructions": [
            "STIR-FRYING TECHNIQUE: Heat wok or large skillet over high heat until smoking. This high heat is crucial for proper stir-frying.",
            "Soak glass noodles in hot water for 8-10 minutes until soft, then drain and cut into manageable lengths.",
            "Cut tofu into cubes and pat dry. Julienne bell pepper and carrot into thin strips.",
            "Mince garlic and ginger. Roughly chop kimchi, reserving juice.",
            "Add sesame oil to hot wok, swirl to coat. Add tofu first, don't move for 2 minutes to develop golden crust.",
            "Push tofu to one side, add garlic and ginger, stir-fry for 30 seconds until fragrant.",
            "Add carrots and bell peppers, stir-fry for 2 minutes using wok hei technique (constant tossing motion).",
            "Add kimchi with juice, cook 1 minute. Add drained noodles and spinach.",
            "Combine soy sauce, rice vinegar, and brown sugar. Pour over noodles.",
            "Toss everything together for 2-3 minutes until noodles are heated through and spinach wilted.",
            "Garnish with sesame seeds and serve immediately."
          ],
          "prep_time": 35,
          "cooking_method": "stir-frying",
          "portion_size": "1 serving",
          "calories": 720,
          "protein": 25,
          "carbs": 108,
          "fat": 18,
          "fiber": 12,
          "goal_alignment": "Fermented kimchi aids digestion and provides probiotics, while high fiber content from vegetables promotes satiety for weight management."
        },
        {
          "meal_type": "dinner",
          "food_name": "Miso-Glazed Eggplant with Fermented Black Bean Fried Rice",
          "description": "Umami-rich glazed eggplant with protein-packed fried rice featuring fermented black beans",
          "ingredients": [
            {
              "name": "Japanese eggplant",
              "amount": 300,
              "unit": "g"
            },
            {
              "name": "white miso paste",
              "amount": 25,
              "unit": "g"
            },
            {
              "name": "mirin",
              "amount": 15,
              "unit": "ml"
            },
            {
              "name": "rice vinegar",
              "amount": 10,
              "unit": "ml"
            },
            {
              "name": "brown rice",
              "amount": 150,
              "unit": "g"
            },
            {
              "name": "fermented black beans",
              "amount": 20,
              "unit": "g"
            },
            {
              "name": "eggs",
              "amount": 2,
              "unit": "large"
            },
            {
              "name": "firm tofu",
              "amount": 100,
              "unit": "g"
            },
            {
              "name": "edamame",
              "amount": 80,
              "unit": "g"
            },
            {
              "name": "red bell pepper",
              "amount": 60,
              "unit": "g"
            },
            {
              "name": "scallions",
              "amount": 3,
              "unit": "stalks"
            },
            {
              "name": "garlic",
              "amount": 12,
              "unit": "g"
            },
            {
              "name": "ginger",
              "amount": 8,
              "unit": "g"
            },
            {
              "name": "vegetable oil",
              "amount": 15,
              "unit": "ml"
            },
            {
              "name": "soy sauce",
              "amount": 15,
              "unit": "ml"
            },
            {
              "name": "sesame oil",
              "amount": 5,
              "unit": "ml"
            }
          ],
          "instructions": [
            "Cook brown rice according to package directions and let cool completely (preferably day-old rice works best).",
            "FERMENTED INGREDIENT PREPARATION: Rinse fermented black beans and mash lightly with flat side of knife to release flavor.",
            "Cut eggplant into 1-inch thick rounds, score in crosshatch pattern without cutting through skin.",
            "Whisk together miso paste, mirin, and rice vinegar until smooth for glaze.",
            "Heat oven to 425°F. Brush eggplant with oil and roast 15 minutes.",
            "Brush miso glaze on eggplant, roast another 10-12 minutes until caramelized and tender.",
            "Meanwhile, cube tofu and dice bell pepper. Separate white and green parts of scallions.",
            "Heat wok over high heat, add oil. Scramble eggs and remove from wok.",
            "Add tofu to wok, cook until golden. Add garlic, ginger, and fermented black beans, stir-fry 1 minute.",
            "Add cold rice, breaking up clumps, stir-fry 3-4 minutes until heated through.",
            "Add bell pepper, edamame, and white parts of scallions, cook 2 minutes.",
            "Return eggs to wok, add soy sauce and sesame oil, toss to combine.",
            "Serve fried rice topped with miso-glazed eggplant and green scallions."
          ],
          "prep_time": 45,
          "cooking_method": "roasting and stir-frying",
          "portion_size": "1 serving",
          "calories": 595,
          "protein": 47,
          "carbs": 77,
          "fat": 20,
          "fiber": 15,
          "goal_alignment": "Fermented black beans provide complex umami flavors while high fiber and protein content create lasting satiety, supporting calorie management goals."
        }
      ],
      "total_nutrition": {
        "calories": 1800,
        "protein": 100,
        "carbs": 220,
        "fat": 60,
        "fiber": 33
      },
      "day_notes": "This day focuses on mastering three essential Asian cooking techniques: steaming for delicate textures, high-heat stir-frying for wok hei, and incorporating fermented ingredients for complex flavor development."
    }
  ],
  "total_days": 1,
  "dietary_restrictions": [],
  "target_nutrition": {},
  "created_at": "2025-07-14T13:50:01.967478+00:00",
  "updated_at": "2025-07-14T13:50:01.967478+00:00",
  "is_active": false,
  "is_current_version": true,
  "parent_version": null,
  "tags": [],
  "variety_score": "Excellent variety in cooking methods (steaming, stir-frying, roasting) and Asian cuisines (Chinese, Korean, Japanese) while maintaining nutritional targets",
  "goal_alignment": "This plan supports weight loss through strategic use of high-fiber vegetables, lean proteins, and fermented foods that promote satiety and digestive health. Each meal is designed to be filling while staying within caloric targets.",
  "shopping_tips": "Shop for kimchi and fermented black beans at Asian markets for best quality and price. Buy firm and silken tofu from different sections. Pre-cook brown rice in batches for easier meal prep. Look for Japanese eggplant which has thinner skin and fewer seeds than regular eggplant.",
  "_id": "68750b09b21a11359bb7944a"
}